;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)

(package! dockerfile-mode)
(package! hydra)
(package! which-key)
(package! ace-window)
(package! nginx-mode)
(package! yaml-mode)
(package! tuareg)
(package! auto-complete)
(package! enh-ruby-mode)
(package! robe)
(package! markdown-mode)
(package! markdown-mode+)
(package! jsonnet-mode)
(package! protobuf-mode)
(package! go-mode)
(package! go-eldoc)
(package! rust-mode)
(package! racer)
(package! flycheck-rust)
